{
    "citations": [
        {
            "text": "Faire confiance à son propre pouvoir et à sa propre force.",
            "from": "J.R.R Tolkien"
        },
        {
            "text": "Without a goal, you can't score.",
            "from": "Johan Cruyff"
        },
        {
            "text": "Ce n'est pas parce qu'ils sont nombreux à avoir tort qu'ils ont raison.",
            "from": "Coluche"
        },
        {
            "text": "Le principal fléau de l'humanité n'est pas l'ignorance, mais le refus de savoir.",
            "from": "Simone de Beauvoir"
        },
        {
            "text": "Rien n'est vrai, tout est permis.",
            "from": "Nietzsche"
        },
        {
            "text": "One who makes no mistakes makes nothing at all.",
            "from": "Giacomo Casanova"
        },
        {
            "text": "L'espoir est la volonté des faibles, ceux qui gagnent font.",
            "from": "Roger Lannoy"
        },
        {
            "text": "La modernité, ce n'est pas aller plus vite, c'est avancer avec plus de sagesse.",
            "from": ""
        },
        {
            "text": "C'est en gardant les pieds sur Terre qu'on arrive à toucher les étoiles.",
            "from": "Mike Horn"
        },
        {
            "text": "C'est par la raison que l'Homme accède à la liberté.",
            "from": "Spinoza"
        },
        {
            "text": "Le premier savoir est le savoir de mon ignorance : c'est le début de l'intelligence.",
            "from": "Socrate"
        },
        {
            "text": "Si Dieu n'existait pas, tout serait permis.",
            "from": "Dostoïevsky"
        },
        {
            "text": "L'Enfer, c'est les autres.",
            "from": "Jean-Paul Sartre"
        },
        {
            "text": "Que la force me soit donnée de supporter ce qui ne peut être changé et le courage de changer ce qui peut l'être mais aussi la sagesse de distinguer l'un de l'autre.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "Ceux qui nous inspirent ne sont pas guidés par ce qu'ils font mais pourquoi ils le font.",
            "from": "Simon Sinek"
        },
        {
            "text": "Il y a plus de choses dans le ciel et sur la Terre que dans toute notre philosophie.",
            "from": "William Shakespeare"
        },
        {
            "text": "La main qui donne est toujours placée au-dessus de celle qui reçoit.",
            "from": "Proverbe Africain"
        },
        {
            "text": "La plus perdue des journée est celle où l'on n'a pas ri.",
            "from": "Sébastien-Roch Nicolas de Chamfort"
        },
        {
            "text": "Soyez le changement que vous voulez voir dans le monde.",
            "from": "Gandhi"
        },
        {
            "text": "Si tu as une pomme, que j'ai une pomme, et que l'on échange nos pommes, nous aurons chacun une pomme. Mais si tu as une idée, que j'ai une idée et que l'on échange nos idée, nous aurons chacun deux idées.",
            "from": "Georges Bernard Shaw"
        },
        {
            "text": "Le danger pour l'Homme est de vivre dans l'unique dessein de plaire à la société au point d'en perdre son entité.",
            "from": "Eric Hude"
        },
        {
            "text": "Connais-toi toi-même.",
            "from": "Socrate"
        },
        {
            "text": "L'homme qui conduit la raison est plus libre dans la cité où il vit selon le décret commun, que dans la solitude où il n'obéit qu'à lui-même.",
            "from": "Spinoza"
        },
        {
            "text": "Il ne faut pas compter sur ceux qui créent les problèmes pour les résoudre.",
            "from": "Albert Einstein"
        },
        {
            "text": "Se décrisper, se détendre par rapport au but, ça appartient à Dieu. Par contre, ce qui m'appartient, c'est de tout faire, de tout mettre en œuvre pour me rapprocher du but.",
            "from": ""
        },
        {
            "text": "Mille pas en avant, neuf cent quatre-vingt-dix-neuf, c'est cela le progrès.",
            "from": "Henri-Frédéric Amiel"
        },
        {
            "text": "Aux yeux d'un sage le chercheur de vérité doit parfois ressembler à l'ivrogne qui cherche ses clés sous le lampadaire parce que c'est là qu'il est le mieux éclairé.",
            "from": "Bernard Campan"
        },
        {
            "text": "Il n'y a pas de connaissance au-delà de l'expérience.",
            "from": "David Hume"
        },
        {
            "text": "Une once d'action vaut mieux qu'une tonne de théorie.",
            "from": "Ralph Waldo Emerson"
        },
        {
            "text": "Ne doutez jamais qu'un petit groupe de personnes décidées puisse changer le monde. C'est même le seul moyen qui ait marché jusqu'à présent.",
            "from": "Margaret Mead"
        },
        {
            "text": "Que ton alimentation soit ta première médecine.",
            "from": "Hypocrate"
        },
        {
            "text": "Si les gens ne savent pas bien écrire, ils ne sauront pas bien penser, et s'ils ne savent pas bien penser, d'autres penseront à leur place.",
            "from": "Eric Blair"
        },
        {
            "text": "Dans des temps de tromperie généralisée, le seul fait de dire la vérité est un acte révolutionnaire.",
            "from": "Eric Blair"
        },
        {
            "text": "Les seules défenses qui sont bonnes, sures, durables, sont celles qui dépendent de toi-même et de ta valeur.",
            "from": "Nicolas Machiavel"
        },
        {
            "text": "Si tu veux jouer au chevalier blanc, assure-toi d'avoir le slip propre.",
            "from": ""
        },
        {
            "text": "Dans un monde ou chacun triche, c'est l'Homme vrai qui fait figure de charlatan",
            "from": "André Gide"
        },
        {
            "text": "Ce ne sont pas ceux qui font le mal qui le rendent insupportable, mais ceux qui regardent et laissent faire.",
            "from": "Albert Einstein"
        },
        {
            "text": "Ce que le cœur veut, le corps l'endure.",
            "from": ""
        },
        {
            "text": "L'idéal de la vie n'est pas l'espoir de devenir parfait, c'est la volonté d'être toujours meilleur.",
            "from": "Ralph Emerson"
        },
        {
            "text": "La servitude volontaire, c'est l'abandon de sa liberté en échange d'un confort psychologique.",
            "from": "Etienne de La Boétie"
        },
        {
            "text": "La compulsion de consommation compenserait le non-accomplissement dans l'échelle sociale verticale.",
            "from": "Jean Baudrillard"
        },
        {
            "text": "Si tu veux ce T-shirt synthétique, n'oublie pas qu'il va aider un riche à acheter sa 3ème Mercedes, tandis que celui fabriqué à la main aidera une femme du village à allumer un feu pour nourrir sa famille.",
            "from": "Vandana Shiva"
        },
        {
            "text": "On ne déplore jamais la perte de ce que l'on n'a jamais eu.",
            "from": "Etienne de La Boétie"
        },
        {
            "text": "La première raison de la servitude volontaire, c'est l'habitude.",
            "from": "Etienne de La Boétie"
        },
        {
            "text": "Le secret du succès est de savoir ce que personne d'autre ne sait.",
            "from": "Aristote Onassis"
        },
        {
            "text": "Si tu ne prends pas le changement par la main, il te prendra par la gorge.",
            "from": "Winston Churchill"
        },
        {
            "text": "Si vos rêves ne vous font pas peur, c'est qu'ils ne sont pas assez grands.",
            "from": "Ellen Johnson Sirleaf"
        },
        {
            "text": "Les espèces qui survivront ne sont ni les plus fortes ni les plus intelligentes, mais celles qui auront su s'adapter à leur environnement.",
            "from": "Charles Darwin"
        },
        {
            "text": "Ce qui n'est pas utile à l'essaim n'est pas utile à l'abeille non plus.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "Le monde est changement ; la vie remplacement.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "C'est chose royale que de faire le bien et d'être décrié.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "Il ne faut pas s'irriter des choses, car elles ne s'en soucient pas.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "L'art de vivre est plus semblable à celui de la lutte qu'à celui de la danse, en ce qu'il faut se tenir prêt et sans broncher à parer aux coups directs et non prévus.",
            "from": "Marc-Aurèle"
        },
        {
            "text": "La propagande est à la démocratie ce que la matraque est à la dictature.",
            "from": "Noam Chomsky"
        },
        {
            "text": "Si l'univers physique est soumis aux lois du mouvement, l'univers moral ne l'est pas moins à celles de l'intérêt.",
            "from": "Helvétius"
        },
        {
            "text": "Ils ne sont grands que parce que nous sommes à genoux.",
            "from": "Etienne de La Boétie"
        },
        {
            "text": "Dire que vous n'en avez rien à faire de la surveillance de masse car vous n'avez rien à cacher, c'est comme dire que vous n'en avez rien à faire de la liberté d'expression car vous n'avez rien dire.",
            "from": "Edward Snowden"
        },
        {
            "text": "Chaque homme doit décider s’il marchera dans la lumière de l’altruisme créatif ou dans les ténèbres de l’égoïsme destructeur.",
            "from": "Martin Luther King"
        }
    ]
}