{
    "projects": [
        {
            "title": "GSB",
            "description": "Galaxy Swiss Bourdin est une entreprise du secteur pharmaceutique qui est issue de la fusion entre le géant américain Galaxy et le conglomérat européen Swiss Bourdin. Suite à cette fusion, le groupe cherche à optimiser son activité en uniformisant la gestion des frais professionnels des visiteurs médicaux par le biais d'une application de type client léger. Cette dernière est utilisée par les visiteurs médicaux pour renseigner leurs frais, et par les comptables qui se chargent de la gestion de ces frais. Il existe deux types de frais, les frais forfaitaires (déplacement, hébergement, restauration) et les autres : les frais hors-forfait.\r\nL'objectif ici était de développer la partie comptable, mais aussi de développer un service Windows qui gérerait la clôture des fiches de frais non clôturées du mois courant des visiteurs médicaux au début de la campagne de validation par les comptables.\r\nL'application est hébergée sur un serveur Apache 2 avec MariaDB et PhpMyAdmin. Le tout sur une machine Debian 9.\r\n\r\nTâches réalisées :\r\n- Installation et configuration du serveur web\r\n- Développement du module permettant aux visiteurs médicaux de télécharger leurs fiches de frais des mois précédents, et stockage d'une copie sur le serveur\r\n- Veiller au respect des normes d'écriture sur l'ensemble du code PHP\r\n- Pour le service Windows, développement de la classe métier de gestion des dates et développement d'une classe d'accès aux données réutilisable\r\n\r\nTechnologies :\r\n- Environnement : NetBeans 8.2 - Visual Studio 2017 - MySQL Workbench - Wamp - phpDocumentor\r\n- Langages : PHP - HTML - CSS - JavaScript - Bootstrap - C# - SQL\r\n- Serveur : Apache 2 - MariaDB - PhpMyAdmin - Debian 9\r\n- Autres : Trello - Git - GitHub",
            "tag": "Projet BTS SIO",
            "files": {"cover": "gsb/gsb.webp", "files": {}, "links": {}, "images": ["gsb/cpt_accueil.webp", "gsb/cpt_mep.webp", "gsb/cpt_valid.webp", "gsb/vis_fiches.webp", "gsb/vis_pdf.webp"]},
            "slug": "gsb",
            "context": null,
            "start_date": "2017-09-01",
            "end_date": "2018-06-01"
        },
        {
            "title": "Maison des Ligues",
            "description": "La Maison des Ligues de Lorraine (M2L) a pour mission de fournir des espaces et des services aux différentes ligues sportives régionales et à d’autres structures hébergées. La M2L est une structure financée par le Conseil Régional de Lorraine dont l'administration est déléguée au Comité Régional Olympique et Sportif de Lorraine (CROSL).\r\n\r\nTâches réalisées :\r\n- Installation de Oracle XE sur Windows Server 2012 R2\r\n- Ecriture du trigger pour le contrôle des dates de vacation\r\n- Vidage des zones de saisie après l'inscription d'une personne\r\n- Envoi d'un mail de confirmation après l'inscription d'une personne à un atelier\r\n- Développement de l'API permettant de générer un QR Code contenant l'ID du participant\r\n- Développement de la méthode de génération de la clé Wi-Fi au moment de l'enregistrement de l'arrivée d'un participant\r\n- Manipulation de la base de données Oracle dans le but d'y intégrer les statistiques\r\n- Développement de l'application de type client léger en Symfony 4 permettant aux participants de saisir leur avis sur les ateliers\r\n- Développement de l'application de type client riche en C# permettant d'afficher les graphiques des statistiques\r\n- Documentation technique\r\n\r\nTechnologies :\r\n- Environnement : Visual Studio 2017 - PhpStorm - Wamp - Oracle SQL Developer\r\n- Langages : C# - PHP - Symfony 4 - HTML - CSS - JavaScript - Bootstrap - Twig - SQL - PL\/SQL\r\n- Serveur : Windows Server 2012 R2 - Oracle XE\r\n- Autres : Trello - Git - Microsoft Team Service - GitHub",
            "tag": "Projet BTS SIO",
            "files": {"cover": "m2l/m2l.webp", "files": {}, "links": {"0": {"path": "https://github.com/thlaure/SymfonyM2L", "title": "Lien vers le GitHub de la partie web du projet"}, "1": {"path": "https://github.com/thlaure/MaisonDesLigues", "title": "Lien vers le GitHub de la partie client lourd du projet"}}, "images": []},
            "slug": "maison-des-ligues-de-lorraine",
            "context": null,
            "start_date": "2017-09-01",
            "end_date": "2018-06-01"
        },
        {
            "title": "Oxford",
            "description": "Projet agile réalisé par toute la promotion dans l'objectif d'une présentation pour le forum des métiers du numérique de Toulon.\r\nCette réalisation est un projet de reconnaissance faciale utilisant l'API Face de Microsoft.\r\nNous travaillions dans un faux contexte d'entreprise qui devait mettre en place un système d'identification des employés. La solution retenue était la mise en place d'un système de reconnaissance faciale avec un enregistrement préalable des employés en base de données.\r\nTrois équipes étaient sur ce projet : une équipe sur la partie PHP pour développer une application web d'administration et de gestion des employés, et deux équipes sur la partie C# : une pour la partie inscription de l'employé, et la seconde pour la partie correspondance du profil avec un profil stocké dans une base de données MySQL.\r\nL'organisation du projet était la suivante : chaque mardi soir nous avions une réunion en visio conférence pour parler de l'avancée du projet et des difficultés rencontrées, nous utilisions Trello pour que tout le monde puisse suivre l'avancement global du projet, et nous utilisions pour la même raison des kanbans en classe. Chaque étape du projet était définie dans un sprint.\r\n\r\nTechnologies utilisées :\r\n- Environnement : Visual Studio 2017 - Windows 10\r\n- Langages : C# - SQL\r\n- Autres : Git - GitHub - GitKraken - Trello - Scrum\r\n",
            "tag": "Projet BTS SIO",
            "files": {"cover": "oxford/oxford.webp", "files": {"0": {"path": "btssio/presentation_projet_oxford.pdf", "title": "Support de présentation du projet Oxford"}}, "links": {}, "images": []},
            "slug": "oxford",
            "context": null,
            "start_date": "2017-09-01",
            "end_date": "2017-12-01"
        },
        {
            "title": "Siomag",
            "description": "SIOMAG est un magazine d'informatique écrit par les étudiants de première année de BTS SIO du lycée Bonaparte. Ils sont aidés par l'équipe pédagogique qui les entoure, à savoir les professeurs d'informatique et la documentaliste du CDI du lycée.\r\nCe projet de magazine a été lancé lors de l'année scolaire 2016\/2017, la promotion de 2017\/2018 a donc sorti le deuxième numéro de ce magazine.\r\nIl est réalisé à l'aide d'un outil de publication de magazines Madmagz. Cet outil permet de créer des magazines au format web, PDF et aussi papier.\r\nChaque étudiant a écrit un ou deux articles sur un sujet qui l'intéressait dans le domaine de l'informatique. Ensuite, les articles sont répartis dans six catégories d'articles.\r\nIl a pour but de faire parler du BTS SIO dans la région toulonnaise, de le faire découvrir, et de permettre aux étudiants d'avoir un aperçu du déroulement d'une édition de magazine.",
            "tag": "Projet BTS SIO",
            "files": {"cover":"siomag/siomag.webp", "files": {}, "links": {"0": {"path": "https://madmagz.com/fr/magazine/1031220#/page/1", "title": "Lien vers le Siomag 2"}}, "images": []},
            "slug": "siomag",
            "context": null,
            "start_date": "2017-10-01",
            "end_date": "2017-11-01"
        },
        {
            "title": "Gestion de parc informatique",
            "description": "Ensemble de TP ayant pour objectif de mettre en place une petite infrastructure réseau comprenant un serveur web, un routeur et trois machines clientes. Le but de nous donner plus de notions dans le domaine de l'administration réseau ainsi que dans l'amortissement du matériel.\r\n\r\nTechnologies :\r\n- Environnement : VirtualBox, Debian 9, Windows 10, Ubuntu 17\r\n- Serveur : Apache 2, MariaDB, PhpMyAdmin, ProFTPD, GLPI, OCS Inventory NG\r\n\r\nL'installation s'est faite selon les étapes suivantes :\r\n- Installation et configuration du serveur web sous Debian 9 : Apache 2, PhpMyAdmin, MariaDB, ProFTPD\r\n- Installation des clients graphiques : Debian 9, Windows 10, Ubuntu 17\r\n- Installation et configuration du routeur Debian 9\r\n- Configuration des interfaces réseau de chaque machine\r\n- Installation de GLPI et de OCS Inventory sur le serveur web\r\n- Installation des agents OCS sur les machines clientes\r\n- Remontée des informations sur les clients graphiques\r\n- Calcul du coût de l'amortissement du matériel\r\n- Installation et configuration d'un serveur de sauvegarde\r\n- Configuration de HeartBeat et DRBD entre deux serveurs web dans le but de mettre en place un système de tolérance de panne transparente",
            "tag": "Projet BTS SIO",
            "files": {"cover": "si7/si7.webp", "files": {}, "links": {}, "images": ["si7/infrastructure.webp", "si7/glpi.webp"]},
            "slug": "gestion-de-parc-informatique",
            "context": null,
            "start_date": "2017-09-01",
            "end_date": "2018-01-01"
        },
        {
            "title": "Gestion Mobilité Bancaire",
            "description": "Développement d'une application web utilisant des technologies Java EE. L'objectif était de comparer deux fichiers PDF : le premier contenait la liste des assurés débiteurs, et le second contenait la liste des assurés ayant changé de banque ainsi que leurs informations. Si des assurés étaient présents dans les deux fichiers, ils étaient signalés au service comptable de la CPAM à l'aide d'un mail afin qu'il traite ce signalement. Lorsqu'il y a signalement, celui-ci est enregistré en base de données. L'application web était là pour le traitement des signalements.\r\nLors de ce projet, un cahier des charges a été produit et modifié à l'issue de chaque réunion avec les clients.\r\nActuellement, cette application est en service au sein de la CPAM de Toulon.\r\nL'ensemble du projet s'appuie sur une architecture MVC avec le framework JSF (JavaServer Faces) avec l'utilisation de PrimeFaces et tourne sur un serveur GlassFish. EclipseLink et JPA ont été utilisés pour la partie persistance des données dans une base de données SQL Server.",
            "tag": "Stage 1ère année BTS SIO",
            "files": {"cover": "gmb/gmb.webp", "files": {"0": {"path": "btssio/cahier_des_charges_stage1.pdf", "title": "Cahier des charges"}}, "links": {}, "images": []},
            "slug": "gestion-mobilite-bancaire",
            "context": "Service développement de la CPAM du Var de Toulon",
            "start_date": "2017-05-01",
            "end_date": "2017-06-01"
        },
        {
            "title": "Rezone",
            "description": "Rezone est une application web de cartographie dont le but est d'aider les professionnels de santé à trouver un bassin d'installation et de les inviter à s'installer dans des endroits où ils sont peu présents par rapport à la population locale.\r\nMais cette application est en réalité décomposée en deux partie :\r\n- L'application pour les professionnels de santé qui une application web exportable sur n'importe quelle infrastructure, et donc écrite en HTML, CSS, et JavaScript.\r\n- L'application client léger développée en Java EE suivant le framework MVC JSF tournant sur un serveur Payara permettant aux internes de la CPAM de gérer les demandes d'installation des professionnels de santé.\r\n\r\nLe fonctionnement des technologies utilisées entre elles a été assez compliqué à comprendre au début, et je vais l'expliquer ici après les avoir listées :\r\n- PostGIS : Extension de PostgreSQL qui active la manipulation d’informations géographiques sous forme de géométries (des polygones par exemple) en respectant les standards établis par l’OGS (Open Geospacial Consortium). Il permet donc à PostgreSQL d’être un SGBD spatial en stockant des objets graphiques, et de permettre de réaliser des opérations sur les zones enregistrées (comme faire des fusions). Les polygones importés dans PostgreSQL sont ceux fournis par Data Gouv.\r\n- Protocole WMS (Web Map Service) : Protocole de communication standard permettant d’obtenir des cartes de données géoréférencées à partir de serveur de donnée. Cela permet de mettre en place un réseau de serveurs cartographiques à partir desquels des clients peuvent construire des cartes interactives.\r\n- GeoServer  : Serveur Open Source écrit en Java qui permet aux utilisateurs de partager et modifier des données géographiques. Il implémente le protocole WMS (Web Map Service) qui permet, au moyen du URL formatée, d’interroger des API cartographiques telles que OpenLayers et Leaflet. Il va chercher les géométries qui sont stockées dans PostgreSQL et les transforme en images\/tuiles.\r\n- OpenStreetMap  : Projet qui a pour but de constituer une base de données du monde permettant de créer une carte.\r\n- OpenLayers : Bibliothèque JavaScript sous licence BSD avec un noyau de fonctionnalités destiné à la mise en place d’applications web cartographiques dynamiques. Cette API utilise la carte fournie par OpenStreetMap. OpenLayers récupère les tuiles qui sont sur GeoServer et les affiche.\r\n\r\nGeoServer implémente le protocole WMS (Web Map Service) qui permet, au moyen d’une URL formatée, d’interroger des API cartographiques telles que OpenLayers et Leaflet qui utilisent la carte fournie par OpenStreetMap.\r\nGeoServer va diffuser les données (dessiner et générer des images ou calques) depuis la base de données PostgreSQL (les données de type Geometry implémentées par PostGIS fournies par Data Gouv), et OpenLayers va récupérer ces données pour les assembler. Le principe est d’utiliser plusieurs calques de tuiles.\r\nChacun de ces calques correspond à une requête dans la base de données PostgreSQL. PostGIS permet de fusionner des zones (ou communes) afin de créer les bassins.",
            "tag": "Stage 2ème année BTS SIO",
            "files": {"cover": "rezone/rezone.webp", "files": {}, "links": {"0": {"path": "http://rezone.ameli.fr/rezone/", "title": "Lien vers Rezone"}}, "images": []},
            "slug": "rezone",
            "context": "Service développement de la CPAM du Var de Toulon",
            "start_date": "2018-01-01",
            "end_date": "2018-03-01"
        },
        {
            "title": "GolfPrintStore",
            "description": "Site e-commerce pour RM Concept, ayant pour but de vendre des balles de golf personnalisables à des particuliers et à des entreprises.\r\n\r\nMissions :\r\n- Création du magasin (ou catalogue) où seront affichés les produits. Lorsqu'on clique sur un produit, une nouvelle page s'ouvre avec la description de celui-ci, le lien permettant de le personnaliser, la quantité à ajouter, et le bouton d'ajout au panier.\r\n- Formulaire de création de compte client avec chiffrage du mot de passe en base de données.\r\n- Formulaire de login sécurisé.\r\n- Compte client sur lequel l'intéressé peut modifier ses informations et avoir le détail de ses commandes.\r\n- Accès au détail du panier.\r\n- Création d'une commande (possibilité de l'annuler) avec choix du transporteur et du moyen de paiement, puis validation.\r\n- Module de personnalisation des balles en JavaScript. Le client a la possibilité d'ajouter du texte ou une image.\r\n- Interface d'administration pour le propriétaire du site lui permettant de gérer ses stocks, d'ajouter des produits, d'avoir accès aux informations des clients ainsi qu'à leurs commandes.\r\n\r\nTechnologies :\r\n- Environnement : VS Code - MySQL Workbench - Wamp\r\n- Langages : HTML - CSS - JavaScript - jQuery - Symfony - Twig\r\n- Autres : Git - Kanban\r\n\r\nLes images suivantes ne sont pas fidèles à ce qui a été fait dernièrement, depuis le déploiement du site, il y a eu des modifications auxquelles je n'ai pas participé.",
            "tag": "Expérience freelance",
            "files": {"cover": "rmconcept/rmconcept.webp", "files": {}, "links": {"0": {"path": "https://www.golfprintstore.fr/", "title": "Lien vers GolfPrintStore"}}, "images": ["rmconcept/login.webp", "rmconcept/magasin.webp", "rmconcept/panier.webp", "rmconcept/produit.webp"]},
            "slug": "golfprintstore",
            "context": "RM Concept",
            "start_date": "2018-07-01",
            "end_date": "2018-09-01"
        },
        {
            "title": "TP Symfony",
            "description": "TP Symfony écrit pour le BTS SIO option SLAM du lycée Bonaparte de Toulon, supervisé par les professeurs de développement de celui-ci.\r\nLe but était d'offrir aux étudiants une approche différente par rapport à celle que j'ai eue quand j'étais à leur place.\r\nCe TP s'appuie sur la version 4.1 du framework, je l'ai rédigé au moment où celle-ci venait de paraître.",
            "tag": "Projet personnel",
            "files": {"cover": "rmconcept/rmconcept.webp", "files": {"0": {"path": "btssio/symfony4_tp.pdf", "title": "TP Symfony au format PDF"}}, "links": {"0": {"path": "https://github.com/thlaure/tp_symfony", "title": "Lien vers le GitHub du TP"}}, "images": []},
            "slug": "tp-symfony",
            "context": null,
            "start_date": "2018-07-01",
            "end_date": "2018-10-01"
        },
        {
            "title": "Stamina",
            "description": "Projet de groupe réalisé dans le cadre du cours de gestion de projet Agile pendant lequel nous devions développer un jeu sous Unity3D. J'étais responsable de la communication de la promotion de celui-ci à travers un site web qui comprenait les éléments suivants :\r\n- Une page de présentation du jeu\r\n- Une page bestiaire\r\n- Une page décrivant les cartes du jeu\r\n- Un espace utilisateur sécurisé\r\nJ'assurai également le rôle de Scrum Master.\r\n\r\nTechnologies utilisées :\r\n- Environnement : VS Code - MySQL\r\n- Langages : HTML - CSS - JavaScript - Symfony - Twig\r\n- Autres : Git - Scrum",
            "tag": "Projet CNAM",
            "files": {"cover": "stamina/stamina.webp", "files": {}, "links": {"0": {"path": "https://github.com/thlaure/stamina", "title": "Lien vers le GitHub du projet"}}, "images": []},
            "slug": "stamina",
            "context": null,
            "start_date": "2018-11-01",
            "end_date": "2019-04-01"
        },
        {
            "title": "Espace d'administration du BDE",
            "description": "Ce projet a été réalisé dans le cadre du cours de base de données. Le but était de mettre en place un site web avec une base de données avec l'aide de Docker.\r\nNous avons choisi de travailler sur l'espace d'administration de l'application du BDE pour la communication d'événements et d'informations car nous en avions besoin.\r\nLe projet a été réalisé à deux, je m'occupais de la partie web tandis que mon collègue s'occupait de la partie intégration avec Docker.\r\nNous devions réaliser un dictionnaire des données, une matrice de dépendances fonctionnelles, ainsi que les modèles associés : Modèle Logique des Données et Modèle Entité Association.\r\n\r\nDans le cadre général du développement de l'application cliente du BDE, j'ai réalisé le dossier de spécifications, et participé à la création du logo (Photoshop).\r\n\r\nTechnologies utilisées :\r\n- Environnement : VS Code - Docker - PostgreSQL\r\n- Langages : HTML - CSS - JavaScript - Symfony\r\n- Autres : Git",
            "tag": "Projet CNAM",
            "files": {"cover": "bde/logo_bde.webp", "files": {"0": {"path": "cnam/dossier_de_specifications.pdf", "title": "Dossier de spécifications"}}, "links": {"0": {"path": "https://github.com/thlaure/projet_bdd_cnam", "title": "Lien vers le GitHub du projet"}}, "images": []},
            "slug": "espace-administration-bde",
            "context": null,
            "start_date": "2019-09-01",
            "end_date": "2019-12-01"
        },
        {
            "title": "Feel IT",
            "description": "Projet de groupe réalisé dans le cadre du module projet pluridisciplinaire. Le thème était de faire une représentation de données traitées. Nous avons donc pris le thème de l'analyse de sentiments à travers de textes fictifs récupérés dans Google Colab.\r\nNous avons traité et nettoyé les données avec Python dans un environnement Anaconda grâce à Jupyter. Les données étaient ensuite stockées dans une base de données MySQL. Les données stockées étaient récupérées depuis une API Flask pour être redirigées vers l'UI et représentées avec Chart.js.\r\nLe projet était mené suivant la méthode Scrumban.\r\n\r\nTechnologies :\r\n- Environnement : VS Code - Anaconda - MySQL\r\n- Langages : Python - HTML - CSS - JavaScript\r\n- Autres : Git - Scrumban",
            "tag": "Projet CNAM",
            "files": {"cover": "feelit/feelit.webp", "files": {"0": {"path": "cnam/presentation_feelit.pdf", "title": "Présentation du projet Feel IT"}}, "links": {}, "images": []},
            "slug": "feel-it",
            "context": null,
            "start_date": "2019-09-01",
            "end_date": "2019-12-01"
        },
        {
            "title": "Patoketchup",
            "description": "Projet de groupe réalisé dans le cadre du cours de développement web. Le but était de développer un site du type Marmiton répondant aux besoins suivants :\r\n- Consultation de recettes\r\n- Créer des ingrédients, ustensiles et allergènes\r\n- Création de recettes\r\n- Recherche de recettes\r\n- Modération\r\n- Création de compte utilisateur\r\n- Création de tickets incident\r\n- Confirmation de création de compte depuis un lien envoyé par mail\r\n- Laisser des commentaires sur les recettes\r\n\r\nNous ne devions pas utiliser de framework PHP. Les technologies utilisées étaient :\r\n- Environnement : VS Code - MariaDB - Wamp\r\n- Langages : HTML - CSS - JavaScript - jQuery - PHP\r\n- Autres : Git - Agilité",
            "tag": "Projet CNAM",
            "files": {"cover": "patoketchup/patoketchup.webp", "files": {}, "links": {"0": {"path": "https://thomaslaure.alwaysdata.net/Shlagithon/index.php/home", "title": "Lien vers le site"}, "1": {"path": "https://github.com/thlaure/Patoketchup", "title": "Lien vers le GitHub du projet"}}, "images": []},
            "slug": "patoketchup",
            "context": null,
            "start_date": "2020-03-01",
            "end_date": "2020-06-01"
        },
        {
            "title": "Hiroshima Exploration",
            "description": "Hiroshima Exploration est un projet réalisé en collaboration avec Ingémédia, école de communication audio-visuelle de Toulon, en partenariat avec la Machinaka West National Highway Promotion Council, une association Japonaise chargée de promouvoir le tourisme dans la région de Hiroshima.\r\nIls ont fait appel à nous pour bénéficier du savoir-faire de nos écoles pour que nous les aidions dans cette période difficile due au Covid avec différents projet : AR, VR et Web.\r\nNous avons travaillé en collaboration avec la représentante de l'association en mettant en place l'approche Agile avec la méthode Kanban, pour lui assurer une solution au plus proche de son besoin.\r\nLe site contient 2 parties principales : une timeline présentant les principales périodes historiques de la région de Hiroshima, et une carte interactive permettant de visualiser et d'avoir différentes informations sur différents bâtiments de la Saigoku Road.\r\nLe site est disponible en 3 langues : français, anglais et japonais.\r\n\r\nTechnologies :\r\n- Environnement : Visual Studio Code - Wamp \r\n- Langages : PHP - HTML - CSS - JavaScript - Bootstrap - jQuery\r\n- Autres : Trello - Git - GitHub - Notion",
            "tag": "Projet CNAM",
            "files": {"cover": "hiroshima_exploration/logo.webp", "files": { "0": {"path": "cnam/hiroshima_exploration/note_of_intent.pdf", "title": "Note d'intention"},        "1": {"path": "cnam/hiroshima_exploration/graphic_chart.pdf", "title": "Charte graphique"}, "2": {"path": "cnam/hiroshima_exploration/specifications.pdf", "title": "Cahier des charges"}, "3": {"path": "cnam/hiroshima_exploration/web_presentation.pdf", "title": "Support de présentation"}}, "links": {"0": {"path": "https://hiroshima-exploration.alwaysdata.net/", "title": "Lien vers Hiroshima Exploration"}}, "images": []},
            "slug": "hiroshima-exploration",
            "context": null,
            "start_date": "2020-09-10",
            "end_date": "2021-01-29"
        },
        {
            "title": "Darker Than Dark",
            "description": "Ce projet a été réalisé dans le cadre du cours de Culture Numérique de l'école d'ingénieur du CNAM.\r\n\r\nNotre projet est un jeu d’infiltration dans lequel nous devons passer de salle en salle en évitant de se faire repérer par des drones.\r\nLe jeu implémente plusieurs salles et une difficulté croissante, et nous évoluons dans le noir. Nous pouvons nous repérer grâce aux ondes lumineuses limitées produites par chacun de nos pas, et grâce à un dispositif nous permettant de produire une onde lumineuse de plus grande portée. Ces ondes lumineuses ne produisent pas de lumière à proprement parler, mais dévoilent les formes de l’environnement, nous pouvons donc discerner les murs, couloirs, etc…\r\nAu fur-et-à-mesure de l’avancée dans le jeu, la difficulté augmente et des drones feront leur apparition pour nous bloquer la route. L’objectif est donc de ne pas se faire repérer par les drones pour pouvoir continuer le jeu.\r\nLa sortie est indiquée par un symbole vert, et lorsque nous passons sur ce symbole, nous changeons de salle.\r\nLes modèles de drones et les murs ne sont pas très travaillés car nous sommes plongés dans le noir, ça évite d’ajouter des détails qui ajouteraient de la complexité au niveau du point de vue du joueur pour se repérer et ça permet d’économiser du temps de modélisation pour avancer dans les tâches.\r\n\r\nNous avons réalisé nous-mêmes les shaders et les sons. \r\n\r\nParties réalisées :\r\n - Modélisation 3D avec Blender\r\n - Storytelling\r\n - Stratégie de développement du concept\r\n\r\nTechnologies :\r\n - Langages : C# - Cg\/HLSL (pour les shaders)\r\n - Environnement : Unity3D\r\n - Logiciels : Visual Studio - Blender - LightWave - Abelton Live 10 Suite",
            "tag": "Projet CNAM",
            "files": {"cover": "darker_than_dark/dtd.webp", "files": {"0": {"path": "cnam/presentation_dtd.pdf", "title": "Support de présentation"}}, "links": {}, "images": []},
            "slug": "darker-than-dark",
            "context": null,
            "start_date": "2020-10-06",
            "end_date": "2021-02-12"
        },
        {
            "title": "Mémoire d'ingénieur",
            "description": "Mémoire rédigé à la fin de mon cursus d'ingénieur du CNAM en alternance à Coexel. Le but était de mettre en place un algorithme semi-automatisé permettant d'extraire des informations sur des sites web d'actualités.\r\n\r\nRésumé :\r\n L’activité d’extraction d’actualités prend beaucoup de temps aux équipes de Coexel qui pourrait être mis à profit d’autres projets plus importants et à l’amélioration de son service client, qui fait sa force vis-à-vis de la concurrence.\r\nCe mémoire propose une méthode semi-automatisée qui permet aux clients de réaliser euxmêmes leurs plugins depuis une interface, en sélectionnant la zone du site qui contient les actualités, et dans un second temps en exécutant un algorithme semi-automatisé pour récupérer leurs informations depuis la structure de la page web.\n\rLes tests réalisés montrent la possibilité d’extraire des actualités sur environ 80% des sites web.",
            "tag": "Projet CNAM",
            "files": {"cover": "memoire/memoire.webp", "files": {"0": {"path": "cnam/ING_2018-Memoire-Thomas-LAURE.pdf", "title": "Mémoire d'ingénieur (PDF)"}}, "links": {}, "images": []},
            "slug": "memoire-d-ingenieur",
            "context": null,
            "start_date": "2021-02-15",
            "end_date": "2021-08-13"
        }
    ]
}